Revit 2027 API
IFCExtrusionCreationData.AddOpening Method
 Adds an opening to the data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddOpening(
	IFCExtrusionData data
)
Public Sub AddOpening (
	data As IFCExtrusionData
)
public:
void AddOpening(
	IFCExtrusionData^ data
)
member AddOpening :
        data : IFCExtrusionData -> unit
Parameters
data IFCExtrusionData
 The opening.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The opening is stored for retrieval later via GetOpenings().
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace